script/logs/shipping/2013-04-26/2013-04-26-02.51.52-exception.log


Action: exception
Request: 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:ns2="http://www.ups.com/XMLSchema/XOLTWS/Rate/v1.1" xmlns:ns3="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0"><SOAP-ENV:Header><ns3:UPSSecurity><ns3:UsernameToken><ns3:Username>blochretail</ns3:Username><ns3:Password>F8MZqdRXz</ns3:Password></ns3:UsernameToken><ns3:ServiceAccessToken><ns3:AccessLicenseNumber>3C9B45F3E8717303</ns3:AccessLicenseNumber></ns3:ServiceAccessToken></ns3:UPSSecurity></SOAP-ENV:Header><SOAP-ENV:Body><ns2:RateRequest><ns1:Request><ns1:RequestOption>Shop</ns1:RequestOption></ns1:Request><ns2:Shipment><ns2:Shipper><ns2:Name>Bloch</ns2:Name><ns2:ShipperNumber></ns2:ShipperNumber><ns2:Address><ns2:AddressLine>1170 Trademark Drive, Suite 112</ns2:AddressLine><ns2:City>Reno</ns2:City><ns2:StateProvinceCode>NV</ns2:StateProvinceCode><ns2:PostalCode>89521</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:Shipper><ns2:ShipTo><ns2:Name>bname</ns2:Name><ns2:Address><ns2:AddressLine>670 Park Avenue</ns2:AddressLine><ns2:City>Saint Clair</ns2:City><ns2:StateProvinceCode></ns2:StateProvinceCode><ns2:PostalCode>35004</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode><ns2:ResidentialAddressIndicator></ns2:ResidentialAddressIndicator></ns2:Address></ns2:ShipTo><ns2:ShipFrom><ns2:Name>Bloch</ns2:Name><ns2:Address><ns2:AddressLine>1170 Trademark Drive, Suite 112</ns2:AddressLine><ns2:City>Reno</ns2:City><ns2:StateProvinceCode>NV</ns2:StateProvinceCode><ns2:PostalCode>89521</ns2:PostalCode><ns2:CountryCode>US</ns2:CountryCode></ns2:Address></ns2:ShipFrom><ns2:Package><ns2:PackagingType><ns2:Code>02</ns2:Code><ns2:Description>Rate</ns2:Description></ns2:PackagingType><ns2:Dimensions><ns2:UnitOfMeasurement><ns2:Code>IN</ns2:Code><ns2:Description>inches</ns2:Description></ns2:UnitOfMeasurement><ns2:Length>0</ns2:Length><ns2:Width>0</ns2:Width><ns2:Height>0</ns2:Height></ns2:Dimensions><ns2:PackageWeight><ns2:UnitOfMeasurement><ns2:Code>LBS</ns2:Code><ns2:Description>Pounds</ns2:Description></ns2:UnitOfMeasurement><ns2:Weight>0</ns2:Weight></ns2:PackageWeight><ns2:PackageServiceOptions><ns2:DeclaredValue><ns2:CurrencyCode>USD</ns2:CurrencyCode><ns2:MonetaryValue>1</ns2:MonetaryValue></ns2:DeclaredValue></ns2:PackageServiceOptions></ns2:Package><ns2:ShipmentServiceOptions/></ns2:Shipment></ns2:RateRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

Response: 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><soapenv:Fault><faultcode>Client</faultcode><faultstring>An exception has been raised as a result of client data.</faultstring><detail><err:Errors xmlns:err="http://www.ups.com/XMLSchema/XOLTWS/Error/v1.1"><err:ErrorDetail><err:Severity>Hard</err:Severity><err:PrimaryErrorCode><err:Code>111030</err:Code><err:Description>Packages must weigh more than zero pounds.</err:Description></err:PrimaryErrorCode></err:ErrorDetail></err:Errors></detail></soapenv:Fault></soapenv:Body></soapenv:Envelope>
